In [2]:
# !pip install cx_Oracle

In [3]:
import cx_Oracle

In [7]:
connection = cx_Oracle.connect("hr", "hoseo", "localhost:1521/xe") # uuser-name, 비번, 서버 주소(위치)

In [8]:
cursor = connection.cursor() # cursor : 명령 처리기

In [9]:
cursor.execute("SELECT * FROM DEPARTMENTS") # sqldeveloper 아니더라도 파이선으로 sql문 실행하겠다! # SQL 실행 + 결과를 내부에 저장

In [10]:
for did, dname, mid, lid in cursor:
    print("[{0}][{1}][{2}][{3}]".format(did, dname, mid, lid))

[10][Administration][200][1700]
[20][Marketing][201][1800]
[30][Purchasing][114][1700]
[40][Human Resources][203][2400]
[50][Shipping][121][1500]
[60][IT][103][1400]
[70][Public Relations][204][2700]
[80][Sales][145][2500]
[90][Executive][100][1700]
[100][Finance][108][1700]
[110][Accounting][205][1700]
[120][Treasury][None][1700]
[130][Corporate Tax][None][1700]
[140][Control And Credit][None][1700]
[150][Shareholder Services][None][1700]
[160][Benefits][None][1700]
[170][Manufacturing][None][1700]
[180][Construction][None][1700]
[190][Contracting][None][1700]
[200][Operations][None][1700]
[210][IT Support][None][1700]
[220][NOC][None][1700]
[230][IT Helpdesk][None][1700]
[240][Government Sales][None][1700]
[250][Retail Sales][None][1700]
[260][Recruiting][None][1700]
[270][Payroll][None][1700]

In [11]:
cursor.close()
connection.close() # 연결 종료

In [13]:
import pandas as pd

In [12]:
connection = cx_Oracle.connect("hr", "hoseo", "localhost:1521/xe") # localhost대신 127.0.0.1로 써두 된당

In [14]:
departments = pd.read_sql('SELECT * FROM DEPARTMENTS', connection)

In [15]:
departments

    DEPARTMENT_ID       DEPARTMENT_NAME  MANAGER_ID  LOCATION_ID
0              10        Administration       200.0         1700
1              20             Marketing       201.0         1800
2              30            Purchasing       114.0         1700
3              40       Human Resources       203.0         2400
4              50              Shipping       121.0         1500
5              60                    IT       103.0         1400
6              70      Public Relations       204.0         2700
7              80                 Sales       145.0         2500
8              90             Executive       100.0         1700
9             100               Finance       108.0         1700
10            110            Accounting       205.0         1700
11            120              Treasury         NaN         1700
12            130         Corporate Tax         NaN         1700
13            140    Control And Credit         NaN         1700
14            150  Shareholder Services         NaN         1700
15            160              Benefits         NaN         1700
16            170         Manufacturing         NaN         1700
17            180          Construction         NaN         1700
18            190           Contracting         NaN         1700
19            200            Operations         NaN         1700
20            210            IT Support         NaN         1700
21            220                   NOC         NaN         1700
22            230           IT Helpdesk         NaN         1700
23            240      Government Sales         NaN         1700
24            250          Retail Sales         NaN         1700
25            260            Recruiting         NaN         1700
26            270               Payroll         NaN         1700

In [16]:
connection.close()

In [21]:
connection = cx_Oracle.connect('hr', 'hoseo', '127.0.0.1:1521/xe')
cursor = connection.cursor()
cursor.execute("""
    SELECT EMPLOYEE_ID, FIRST_NAME, LAST_NAME, HIRE_DATE 
    FROM EMPLOYEES
    WHERE LOWER(FIRST_NAME) LIKE '%x%'""") # 소문자로 비교
for eid, fn, ln, hd in cursor:
    print("[{0}][{1}][{2}][{3}]".format(eid, fn, ln, hd))

cursor.close()
connection.close()

[102][Lex][De Haan][2001-01-13 00:00:00]
[103][Alexander][Hunold][2006-01-03 00:00:00]
[115][Alexander][Khoo][2003-05-18 00:00:00]
[185][Alexis][Bull][2005-02-20 00:00:00]

In [23]:
# sql에서 data 분리하는것이 필요하다.
connection = cx_Oracle.connect('hr', 'hoseo', '127.0.0.1:1521/xe')
cursor = connection.cursor()
cursor.execute("""
    SELECT EMPLOYEE_ID, FIRST_NAME, LAST_NAME, HIRE_DATE 
    FROM EMPLOYEES
    WHERE LOWER(FIRST_NAME) LIKE :fn""", # SQL에서 ":이름"은 변수, 변수에 저장할 것입니다.
    fn='%x%') # 똑같은 결과는 나오지만 완전 다르다. fn은 변하지 않는다. 데이터가 가변적으로 변하기 때문에 fn을 만드는 것이 효율적. 데이터를 fn에 저장 / 실행계획에서는 데이터를 빼고 처리하고 실행할 때에는 데이터로 함 --> 따로 따로 두는 것.
for eid, fn, ln, hd in cursor:
    print("[{0}][{1}][{2}][{3}]".format(eid, fn, ln, hd))

cursor.close()
connection.close()

[102][Lex][De Haan][2001-01-13 00:00:00]
[103][Alexander][Hunold][2006-01-03 00:00:00]
[115][Alexander][Khoo][2003-05-18 00:00:00]
[185][Alexis][Bull][2005-02-20 00:00:00]

In [27]:
name_key = input("name key : ") # 명령행에서 사용자 입력

connection = cx_Oracle.connect('hr', 'hoseo', '127.0.0.1:1521/xe')
employees = pd.read_sql("""
    SELECT EMPLOYEE_ID, FIRST_NAME, LAST_NAME, HIRE_DATE 
    FROM EMPLOYEES
    WHERE LOWER(FIRST_NAME) LIKE :fn""", # fn에 넣기
    connection,
    params={ 'fn' : '%{0}%'.format(name_key)}) # sql문과 data는 분리해서 실행 # fn에는 %사용자 입력%를 넣는다 # 사용자 입력한 글자를 포함하는 이름 출력

connection.close()
employees

name key :  z

   EMPLOYEE_ID FIRST_NAME   LAST_NAME  HIRE_DATE
0          130      Mozhe    Atkinson 2005-10-30
1          136      Hazel  Philtanker 2008-02-06
2          172  Elizabeth       Bates 2007-03-24

In [35]:
country_key = input("country : ") # 명령행에서 사용자 입력

connection = cx_Oracle.connect('hr', 'hoseo', '127.0.0.1:1521/xe')
employees = pd.read_sql("""
    SELECT E.FIRST_NAME, E.LAST_NAME, E.EMAIL, C.COUNTRY_NAME
    FROM EMPLOYEES E, DEPARTMENTS D, LOCATIONS L, COUNTRIES C
    WHERE E.DEPARTMENT_ID = D.DEPARTMENT_ID
          AND D.LOCATION_ID = L.LOCATION_ID
          AND L.COUNTRY_ID = C.COUNTRY_ID
          AND LOWER(C.COUNTRY_NAME) LIKE  :country""", # fn에 넣기
    connection,
    params={ 'country' : '%{0}%'.format(country_key)}) # sql문과 data는 분리해서 실행 # fn에는 %사용자 입력%를 넣는다 # 사용자 입력한 글자를 포함하는 이름 출력

connection.close()
employees

country :  canada

  FIRST_NAME  LAST_NAME     EMAIL COUNTRY_NAME
0    Michael  Hartstein  MHARTSTE       Canada
1        Pat        Fay      PFAY       Canada

In [1]:
import cx_Oracle
import numpy as np
import pandas as pd

In [8]:
conn = cx_Oracle.connect('hr', 'hoseo', '127.0.0.1:1521/xe')    

cursor = conn.cursor()

sql = """INSERT INTO JOBS (JOB_ID, JOB_TITLE, MIN_SALARY, MAX_SALARY)
         VALUES
         (:ID, :TITLE, :MINS, :MAXS) 
        """ # :는 변수라는 것을 알려주는 것


cursor.execute(sql, ID='DB ENG', TITLE="Database Engineer",
               MINS=4000, MAXS=10000)
conn.commit() # 이걸 해줘야 바로 윗 구문을 실행함

cursor.close()
conn.close()

In [14]:
conn = cx_Oracle.connect('hr', 'hoseo', '127.0.0.1:1521/xe')    

sql = """
        SELECT * FROM JOBS WHERE JOB_ID='DB ENG'
      """ # :는 변수라는 것을 알려주는 것

jobs = pd.read_sql(sql, conn)

conn.close()

jobs

Empty DataFrame
Columns: [JOB_ID, JOB_TITLE, MIN_SALARY, MAX_SALARY]
Index: []

In [12]:
conn = cx_Oracle.connect('hr', 'hoseo', '127.0.0.1:1521/xe')    

cursor = conn.cursor()

sql = """
        UPDATE JOBS
        SET MIN_SALARY = :MINS, MAX_SALARY = :MAXS
        WHERE JOB_ID = :ID
        
      """ 


cursor.execute(sql, MINS=5000, MAXS=12000, ID='DB ENG')
conn.commit() 

cursor.close()
conn.close()

In [15]:
conn = cx_Oracle.connect('hr', 'hoseo', '127.0.0.1:1521/xe')    

cursor = conn.cursor()

sql = """
        DELETE FROM JOBS
        WHERE JOB_ID = :ID
      """ 


cursor.execute(sql, ID='DB ENG')
conn.commit() 

cursor.close()
conn.close()

NameError: name 'requests' is not defined